7767517
54 58
Input                    in0                      0 1 in0
ConvolutionDepthWise     convdw_45                1 1 in0 1 0=3 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27 7=3
Convolution              convrelu_0               1 1 1 2 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192 9=1
ConvolutionDepthWise     convdw_46                1 1 2 3 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              convrelu_1               1 1 3 4 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_0              1 2 4 5 6
Pooling                  maxpool2d_23             1 1 6 7 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_47                1 1 7 8 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              convrelu_2               1 1 8 9 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
ConvolutionDepthWise     convdw_48                1 1 9 10 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_3               1 1 10 11 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Split                    splitncnn_1              1 2 11 12 13
Pooling                  maxpool2d_24             1 1 13 14 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_49                1 1 14 15 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_4               1 1 15 16 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
ConvolutionDepthWise     convdw_50                1 1 16 17 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_5               1 1 17 18 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Split                    splitncnn_2              1 2 18 19 20
Pooling                  maxpool2d_25             1 1 20 21 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_51                1 1 21 22 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_6               1 1 22 23 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
ConvolutionDepthWise     convdw_52                1 1 23 24 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Convolution              convrelu_7               1 1 24 25 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Split                    splitncnn_3              1 2 25 26 27
Pooling                  maxpool2d_26             1 1 27 28 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_53                1 1 28 29 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Convolution              convrelu_8               1 1 29 30 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
ConvolutionDepthWise     convdw_54                1 1 30 31 0=1024 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=1024
Convolution              convrelu_9               1 1 31 32 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576 9=1
Deconvolution            deconv_19                1 1 32 33 0=512 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=2097152
Concat                   cat_0                    2 1 26 33 34 0=0
ConvolutionDepthWise     convdw_55                1 1 34 35 0=1024 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=1024
Convolution              convrelu_10              1 1 35 36 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
ConvolutionDepthWise     convdw_56                1 1 36 37 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Convolution              convrelu_11              1 1 37 38 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Deconvolution            deconv_20                1 1 38 39 0=256 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=524288
Concat                   cat_1                    2 1 19 39 40 0=0
ConvolutionDepthWise     convdw_57                1 1 40 41 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Convolution              convrelu_12              1 1 41 42 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
ConvolutionDepthWise     convdw_58                1 1 42 43 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_13              1 1 43 44 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Deconvolution            deconv_21                1 1 44 45 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=131072
Concat                   cat_2                    2 1 12 45 46 0=0
ConvolutionDepthWise     convdw_59                1 1 46 47 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_14              1 1 47 48 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
ConvolutionDepthWise     convdw_60                1 1 48 49 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_15              1 1 49 50 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Deconvolution            deconv_22                1 1 50 51 0=64 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=32768
Concat                   cat_3                    2 1 5 51 52 0=0
ConvolutionDepthWise     convdw_61                1 1 52 53 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_16              1 1 53 54 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
ConvolutionDepthWise     convdw_62                1 1 54 55 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              convrelu_17              1 1 55 56 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              conv_18                  1 1 56 out0 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
